Revit.Elements.ModelText
A Revit ModelText Element Point

Revit.Elements.ModelText.#ctor(Autodesk.Revit.DB.ModelText)
Internal constructor for wrapping a ModelText.
element:

Revit.Elements.ModelText.#ctor(System.String,Autodesk.Revit.DB.SketchPlane,System.Double,System.Double,System.Double,Autodesk.Revit.DB.ModelTextType)
Internal constructor for the ModelText
text:
sketchPlane:
xCoordinateInPlane:
yCoordinateInPlane:
textDepth:
modelTextType:

Revit.Elements.ModelText.InitModelText(Autodesk.Revit.DB.ModelText)
Initialize a ModelText element
element:

Revit.Elements.ModelText.InitModelText(System.String,Autodesk.Revit.DB.SketchPlane,System.Double,System.Double,System.Double,Autodesk.Revit.DB.ModelTextType)
Initialize a ModelText element
text:
sketchPlane:
xCoordinateInPlane:
yCoordinateInPlane:
textDepth:
modelTextType:

Revit.Elements.ModelText.InternalSetDepth(System.Double)
Set the Depth of the ModelText
depth:

Revit.Elements.ModelText.InternalSetText(System.String)
Set the Text of the ModelText
text:

Revit.Elements.ModelText.InternalSetModelTextType(Autodesk.Revit.DB.ModelTextType)
Set the ModelTextType of the text
modelTextType:

Revit.Elements.ModelText.InternalSetModelText(Autodesk.Revit.DB.ModelText)
Set the Element, ElementId, and UniqueId
p:

Revit.Elements.ModelText.PositionUnchanged(Autodesk.Revit.DB.ModelText,Autodesk.Revit.DB.SketchPlane,System.Double,System.Double)
Check if the position of a ModelText has changed, given the original ModelText Element
and the new position in the SketchPlane
oldModelText:
newSketchPlane:
xCoordinateInPlane:
yCoordinateInPlane:
Returns:

Revit.Elements.ModelText.CreateModelText(System.String,Autodesk.Revit.DB.SketchPlane,System.Double,System.Double,System.Double,Autodesk.Revit.DB.ModelTextType)
Create a ModelText element in the current Family Document
text:
sketchPlane:
xCoordinateInPlane:
yCoordinateInPlane:
textDepth:
modelTextType:
Returns:

Revit.Elements.ModelText.ByTextSketchPlaneAndPosition(System.String,Revit.Elements.SketchPlane,System.Double,System.Double,System.Double,Revit.Elements.ModelTextType)
Create a ModelText Element in the Family Document by providing the text, SketchPlane Element host, coordinates (within the plane of the SketchPlane),
the depth of the text, and the text type name
text:
sketchPlane:
xCoordinateInPlane:
yCoordinateInPlane:
textDepth:
modelTextType:
Returns:

Revit.Elements.ModelText.FromExisting(Autodesk.Revit.DB.ModelText,System.Boolean)
Create a ModelText Element from a user selected Element.
pt:
isRevitOwned:
Returns:

Revit.Elements.ModelText.InternalModelText
Internal variable containing the wrapped Revit object

Revit.Elements.ModelText.InternalElement
Reference to the Element

Revit.Elements.ModelText.Text
The Text of the ModelText Element

Revit.Elements.ModelText.Depth
The Depth of the ModelText Element

Revit.Elements.ModelText.Position
The Position of the ModelText Element